ITEST/itest.SpreadsheetResult/test-resources/EPBDS-9437_arr.req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:EPBDS_9437 xmlns:ns1="http://DefaultNamespace">
            <ns1:driver>100</ns1:driver>
        </ns1:EPBDS_9437>
    </soap:Body>
</soap:Envelope>
